Revit 2027 API
FilteredElementCollector(Document, ICollection<ElementId>) Constructor
 Constructs a new FilteredElementCollector that will search and filter a specified set of elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilteredElementCollector(
	Document document,
	ICollection<ElementId> elementIds
)
Public Sub New (
	document As Document,
	elementIds As ICollection(Of ElementId)
)
public:
FilteredElementCollector(
	Document^ document,
	ICollection<ElementId^>^ elementIds
)
new :
        document : Document *
        elementIds : ICollection<ElementId> -> FilteredElementCollector
Parameters
document Document
 The document that owns the elements matching the element ids.
elementIds ICollection<ElementId>
 The input set of element ids.
Exceptions
Exception | Condition
ArgumentException |  The input collection of ids was empty, or its contents were not valid for iteration.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilteredElementCollector Class
FilteredElementCollector Overload
Autodesk.Revit.DB Namespace